android/PortEthernet.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>PortEthernet</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-08-05 22:38:11 CST"/>
<meta name="author" content="Bian Jiang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">PortEthernet</h1>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 流水帐 </a></li>
<li><a href="#sec-2">2 参考 </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 流水帐 </h2>
<div class="outline-text-2" id="text-1">

<p>  近来做Android有线网络移植，主要参考了<a href="http://blog.linuxconsulting.ro">Nicu Pavel</a>的<a href="http://blog.linuxconsulting.ro/2011/06/ethernet-patch-for-android-gingerbread.html">Ethernet patch for Android Gingerbread</a>
按照<a href="http://blog.linuxconsulting.ro">Nicu Pavel</a> 的方法在我的板子上死活运行不起来， 在“设置”里面点击“有线网络配置”，通过logcat
查看一直显示我的"ethernet"服务没有起来(I/EthernetManager(  648): Init Ethernet Manager, service: null)。
</p>
<p>
又仔细检查了一下patch，确定打的补丁没有问题，只能在深入的分析logcat日志。
</p>
<p>
在日志中发现有几处可能和ethernet相关的地方。
</p><ul>
<li>I/ethernet( 2060): Loading ethernet jni class
</li>
<li>I/SystemServer( 2136): NetStat Service
</li>
<li>I/SystemServer( 2136): NetworkManagement Service
</li>
<li>I/SystemServer( 2136): Connectivity Service
</li>
</ul>

<p>
分别查看了这几个文件和相关的服务， 排除了前三个的可能，就拿“Connectivity Service”开始，
打开frameworks/base/services/java/com/android/server/ConnectivityService.java文件:
</p><ul>
<li>打开dbg信息:
    private static final boolean DBG = true;
</li>
<li>在ConnectivityService构造函数里面加了几句打印信息



<pre class="example">String[] naStrings = context.getResources().getStringArray(
        com.android.internal.R.array.networkAttributes);
for (String naString : naStrings) {
    try {
        NetworkAttributes n = new NetworkAttributes(naString);
        // Add Debug Info
        Slog.v(TAG, "[ConnectivityService.java] NetworkAttributes naString: " + naString  + "  type: " + n.mType);
        if (n.mType &gt; ConnectivityManager.MAX_NETWORK_TYPE) {
            Slog.e(TAG, "Error in networkAttributes - ignoring attempt to define type " +
                    n.mType);
            continue;
        }
        if (mNetAttributes[n.mType] != null) {
            Slog.e(TAG, "Error in networkAttributes - ignoring attempt to redefine type " +
                    n.mType);
            continue;
        }
        if ((n.mType != ConnectivityManager.TYPE_ETHERNET) &amp;&amp; (mRadioAttributes[n.mRadio] == null)) {
            Slog.e(TAG, "Error in networkAttributes - ignoring attempt to use undefined " +
                    "radio " + n.mRadio + " in network type " + n.mType);
            continue;
        }
        mNetAttributes[n.mType] = n;
        mNetworksDefined++;
    } catch(Exception e) {
        Slog.e(TAG, "wrong dev exception " + e);
        // ignore it - leave the entry null
    }
}
</pre>


</li>
</ul>
得到相关的打印信息如下:



<pre class="example">I/SystemServer( 2136): NetStat Service
I/SystemServer( 2136): NetworkManagement Service
I/SystemServer( 2136): Connectivity Service
V/ConnectivityService( 2136): ConnectivityService starting up
V/ConnectivityService( 2136): [ConnectivityService.java] NetworkAttributes naString: wifi,1,1,1  type: 1
V/ConnectivityService( 2136): [ConnectivityService.java] NetworkAttributes naString: mobile,0,0,0  type: 0
V/ConnectivityService( 2136): [ConnectivityService.java] NetworkAttributes naString: mobile_mms,2,0,2  type: 2
V/ConnectivityService( 2136): [ConnectivityService.java] NetworkAttributes naString: mobile_supl,3,0,2  type: 3
V/ConnectivityService( 2136): [ConnectivityService.java] NetworkAttributes naString: mobile_hipri,5,0,3  type: 5
</pre>



<p>
除了ethernet其他的信息都有，这个比较奇怪，但是开头的那句, 就是去掉网络的配置信息，应该没有什么问题。
</p>


<pre class="example">String[] naStrings = context.getResources().getStringArray(
        com.android.internal.R.array.networkAttributes);
</pre>



<p> 
又去仔细检测了一遍frameworks/base/core/res/res/values/config.xml文件中的配置信息, 没有问题。
</p>


<pre class="example">&lt;string-array translatable="false" name="networkAttributes"&gt;
&lt;item&gt;"wifi,1,1,1"&lt;/item&gt;
&lt;item&gt;"mobile,0,0,0"&lt;/item&gt;
&lt;item&gt;"mobile_mms,2,0,2"&lt;/item&gt;
&lt;item&gt;"mobile_supl,3,0,2"&lt;/item&gt;
&lt;item&gt;"mobile_hipri,5,0,3"&lt;/item&gt;
&lt;item&gt;"ethernet,9,9,1"&lt;/item&gt;
&lt;/string-array&gt;
</pre>



<p>
看到这里就比较比较奇怪了，配置文件中明明有ethernet但是，通过context去得的数据就偏偏没有ethernet, 再去ConnectivityManager.java中检查了一下 TYPE<sub>ETHERNET的值，的确和配置文件中的数值一样，</sub> MAX<sub>RADIO</sub><sub>TYPE和</sub>
MAX<sub>NETWORK</sub><sub>TYPE也都是TYPE</sub><sub>ETHERNET</sub>. 郁闷了半天也想不出来咋搞，习惯性的永grep -Rw 搜索了一下networkAttributes。
在搜索的结果中发现了"device/samsung/smdkv210/overlay/frameworks/base/core/res/res/values/config.xml"这个地址。
打开文件，发现这个配置里面的networkAttributes没有相关ethernet信息，可能是把framework里面的配置信息覆盖掉了，
在config.xml中增加ethernet相关的信息，编译，运行。OK，果真是这个问题引起的， 唉。
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 参考 </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li><a href="http://blog.linuxconsulting.ro/2011/06/ethernet-patch-for-android-gingerbread.html">Ethernet patch for Android Gingerbread</a>
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author">Author: Bian Jiang</p>
<p class="creator">Org version 7.5 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
